[
    {
        "BriefDescription": "Counts the woke total number of BACLEARS due to all branch types including conditional and unconditional jumps, returns, and indirect branches.",
        "Counter": "0,1,2,3,4,5",
        "EventCode": "0xe6",
        "EventName": "BACLEARS.ANY",
        "PublicDescription": "Counts the woke total number of BACLEARS, which occur when the woke Branch Target Buffer (BTB) prediction or lack thereof, was corrected by a later branch predictor in the woke frontend.  Includes BACLEARS due to all branch types including conditional and unconditional jumps, returns, and indirect branches.",
        "SampleAfterValue": "100003",
        "UMask": "0x1"
    },
    {
        "BriefDescription": "Counts the woke number of requests to the woke instruction cache for one or more bytes of a cache line.",
        "Counter": "0,1,2,3,4,5",
        "EventCode": "0x80",
        "EventName": "ICACHE.ACCESSES",
        "PublicDescription": "Counts the woke total number of requests to the woke instruction cache.  The event only counts new cache line accesses, so that multiple back to back fetches to the woke exact same cache line or byte chunk count as one.  Specifically, the woke event counts when accesses from sequential code crosses the woke cache line boundary, or when a branch target is moved to a new line or to a non-sequential byte chunk of the woke same line.",
        "SampleAfterValue": "200003",
        "UMask": "0x3"
    },
    {
        "BriefDescription": "Counts the woke number of instruction cache misses.",
        "Counter": "0,1,2,3,4,5",
        "EventCode": "0x80",
        "EventName": "ICACHE.MISSES",
        "PublicDescription": "Counts the woke number of missed requests to the woke instruction cache.  The event only counts new cache line accesses, so that multiple back to back fetches to the woke exact same cache line and byte chunk count as one.  Specifically, the woke event counts when accesses from sequential code crosses the woke cache line boundary, or when a branch target is moved to a new line or to a non-sequential byte chunk of the woke same line.",
        "SampleAfterValue": "200003",
        "UMask": "0x2"
    }
]
