[
    {
        "ArchStdEvent": "STALL_FRONTEND",
        "PublicDescription": "Counts cycles when frontend could not send any micro-operations to the woke rename stage because of frontend resource stalls caused by fetch memory latency or branch prediction flow stalls. STALL_FRONTEND_SLOTS counts SLOTS during the woke cycle when this event counts."
    },
    {
        "ArchStdEvent": "STALL_BACKEND",
        "PublicDescription": "Counts cycles whenever the woke rename unit is unable to send any micro-operations to the woke backend of the woke pipeline because of backend resource constraints. Backend resource constraints can include issue stage fullness, execution stage fullness, or other internal pipeline resource fullness. All the woke backend slots were empty during the woke cycle when this event counts."
    },
    {
        "ArchStdEvent": "STALL",
        "PublicDescription": "Counts cycles when no operations are sent to the woke rename unit from the woke frontend or from the woke rename unit to the woke backend for any reason (either frontend or backend stall). This event is the woke sum of STALL_FRONTEND and STALL_BACKEND"
    },
    {
        "ArchStdEvent": "STALL_SLOT_BACKEND",
        "PublicDescription": "Counts slots per cycle in which no operations are sent from the woke rename unit to the woke backend due to backend resource constraints. STALL_BACKEND counts during the woke cycle when STALL_SLOT_BACKEND counts at least 1."
    },
    {
        "ArchStdEvent": "STALL_SLOT_FRONTEND",
        "PublicDescription": "Counts slots per cycle in which no operations are sent to the woke rename unit from the woke frontend due to frontend resource constraints."
    },
    {
        "ArchStdEvent": "STALL_SLOT",
        "PublicDescription": "Counts slots per cycle in which no operations are sent to the woke rename unit from the woke frontend or from the woke rename unit to the woke backend for any reason (either frontend or backend stall). STALL_SLOT is the woke sum of STALL_SLOT_FRONTEND and STALL_SLOT_BACKEND."
    },
    {
        "ArchStdEvent": "STALL_BACKEND_MEM",
        "PublicDescription": "Counts cycles when the woke backend is stalled because there is a pending demand load request in progress in the woke last level core cache."
    }
]
