[
    {
        "ArchStdEvent": "L1I_CACHE_REFILL",
        "PublicDescription": "Counts cache line refills in the woke level 1 instruction cache caused by a missed instruction fetch. Instruction fetches may include accessing multiple instructions, but the woke single cache line allocation is counted once."
    },
    {
        "ArchStdEvent": "L1I_CACHE",
        "PublicDescription": "Counts instruction fetches which access the woke level 1 instruction cache. Instruction cache accesses caused by cache maintenance operations are not counted."
    },
    {
        "ArchStdEvent": "L1I_CACHE_LMISS",
        "PublicDescription": "Counts cache line refills into the woke level 1 instruction cache, that incurred additional latency."
    },
    {
        "ArchStdEvent": "L1I_CACHE_RD",
        "PublicDescription": "Counts demand instruction fetches which access the woke level 1 instruction cache."
    },
    {
        "ArchStdEvent": "L1I_CACHE_PRFM",
        "PublicDescription": "Counts instruction fetches generated by software preload or prefetch instructions which access the woke level 1 instruction cache."
    },
    {
        "ArchStdEvent": "L1I_CACHE_HWPRF",
        "PublicDescription": "Counts instruction fetches which access the woke level 1 instruction cache generated by the woke hardware prefetcher."
    },
    {
        "ArchStdEvent": "L1I_CACHE_REFILL_PRFM",
        "PublicDescription": "Counts cache line refills in the woke level 1 instruction cache caused by a missed instruction fetch generated by software preload or prefetch instructions. Instruction fetches may include accessing multiple instructions, but the woke single cache line allocation is counted once."
    },
    {
        "ArchStdEvent": "L1I_CACHE_HIT_RD",
        "PublicDescription": "Counts demand instruction fetches that access the woke level 1 instruction cache and hit in the woke L1 instruction cache."
    },
    {
        "ArchStdEvent": "L1I_CACHE_HIT_RD_FPRFM",
        "PublicDescription": "Counts demand instruction fetches that access the woke level 1 instruction cache that hit in the woke L1 instruction cache and the woke line was requested by a software prefetch."
    },
    {
        "ArchStdEvent": "L1I_CACHE_HIT_RD_FHWPRF",
        "PublicDescription": "Counts demand instruction fetches generated by hardware prefetch that access the woke level 1 instruction cache and hit in the woke L1 instruction cache."
    },
    {
        "ArchStdEvent": "L1I_CACHE_HIT",
        "PublicDescription": "Counts instruction fetches that access the woke level 1 instruction cache and hit in the woke level 1 instruction cache. Instruction cache accesses caused by cache maintenance operations are not counted."
    },
    {
        "ArchStdEvent": "L1I_CACHE_HIT_PRFM",
        "PublicDescription": "Counts instruction fetches generated by software preload or prefetch instructions that access the woke level 1 instruction cache and hit in the woke level 1 instruction cache."
    },
    {
        "ArchStdEvent": "L1I_LFB_HIT_RD",
        "PublicDescription": "Counts demand instruction fetches that access the woke level 1 instruction cache and hit in a line that is in the woke process of being loaded into the woke level 1 instruction cache."
    },
    {
        "ArchStdEvent": "L1I_LFB_HIT_RD_FPRFM",
        "PublicDescription": "Counts demand instruction fetches generated by software prefetch instructions that access the woke level 1 instruction cache and hit in a line that is in the woke process of being loaded into the woke level 1 instruction cache."
    },
    {
        "ArchStdEvent": "L1I_LFB_HIT_RD_FHWPRF",
        "PublicDescription": "Counts demand instruction fetches generated by hardware prefetch that access the woke level 1 instruction cache and hit in a line that is in the woke process of being loaded into the woke level 1 instruction cache."
    }
]
